In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
dataset = pd.read_csv("../HW02/S02-hw-dataset.csv")
dataset.head()

   user_id   age country  purchases  revenue
0        1  25.0      FR          7      749
1        2  24.0      RU          5     1115
2        3  52.0      FR          7      399
3        4  31.0      RU          6      654
4        5   NaN      DE          6     1296

In [3]:
dataset.tail()

    user_id   age country  purchases  revenue
36       37  18.0      DE          4     1104
37       38  35.0      DE          3      738
38       39  39.0      FR          7     1162
39       40  34.0      RU          7     2086
40       10  24.0      RU          7      511

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   user_id    41 non-null     int64
 1   age        39 non-null     float64
 2   country    41 non-null     object
 3   purchases  41 non-null     int64
 4   revenue    41 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.7+ KB

In [5]:
dataset.describe()

         user_id         age  purchases      revenue
count  41.000000   39.000000  41.000000    41.000000
mean   20.243902   36.512821   4.829268   820.048780
std    11.659289   18.304259   2.710189   613.127269
min     1.000000    5.000000  -1.000000     0.000000
25%    10.000000   24.000000   3.000000   432.000000
50%    20.000000   33.000000   5.000000   693.000000
75%    30.000000   45.500000   7.000000  1115.000000
max    40.000000  120.000000  11.000000  2475.000000

In [29]:
dataset.count()

user_id      41
age          39
country      41
purchases    41
revenue      41
dtype: int64

In [6]:
dataset.isna().mean()
#Считаем долю пропусков в каждом столбце

user_id      0.00000
age          0.04878
country      0.00000
purchases    0.00000
revenue      0.00000
dtype: float64

In [ ]:
dataset.duplicated()
c = 0

for i in range(len(dataset)):
    if dataset.duplicated()[i] == np.True_:
        c +=1
        print(dataset.iloc[i].to_frame().T)
c
#Количество дубликатов

   user_id   age country purchases revenue
40      10  24.0      RU         7     511

1

In [28]:
mask = (dataset['age'] > 100) | (dataset['age'] < 18)
print("Подозрительный возраст: \n",dataset[mask])
mask = dataset['purchases'] < 0
print("Подозрительное количество покупок: \n",dataset[mask])
mask = (dataset['purchases'] == 0) & (dataset['revenue'] > 0)
print("Подозрительный возраст: \n",dataset[mask])
#Вывод подозрительных значений

Подозрительный возраст:
     user_id    age country  purchases  revenue
5         6  120.0      FR         -1      785
20       21    5.0      RU          8     1488
Подозрительное количество покупок:
    user_id    age country  purchases  revenue
5        6  120.0      FR         -1      785
Подозрительный возраст:
 Empty DataFrame
Columns: [user_id, age, country, purchases, revenue]
Index: []

В датасете в двух строках отсутствует возраст,
также имеется 1 полный дубликат,
также имеется 2 строки, у которых подозрительный возраст, в одной из них отрицательное количество покупок

In [ ]:
c_group = dataset.groupby('country')
c_group.size()
#Группируем по странам

country
CN     2
DE     6
FR    12
RU    13
US     8
dtype: int64

In [30]:
c_group.count()

         user_id  age  purchases  revenue
country
CN             2    2          2        2
DE             6    5          6        6
FR            12   12         12       12
RU            13   13         13       13
US             8    7          8        8

In [25]:
dataset.head()

   user_id   age country  purchases  revenue
0        1  25.0      FR          7      749
1        2  24.0      RU          5     1115
2        3  52.0      FR          7      399
3        4  31.0      RU          6      654
4        5   NaN      DE          6     1296